# Exercise 14 Pandas 01

# Import Pandas module and numpy module

In [22]:
import pandas as pd
import numpy as np

# Q1 Read csv file
the file is in './data/eq.csv' and assign it to variable 'eq'

In [23]:
eq=pd.read_csv('./data/earthquake.csv')

# Q2 Show the first 3 lines

In [24]:
eq.head(3)

,Year,Month,Day,Time UTC,Mag,Lat,Lon,Depth km,Region,IRIS ID,Timestamp
0,2019,2,11,3:59:47,2.0,59.8971,-152.7478,93.5,SOUTHERN ALASKA,11004556,1549857587
1,2019,2,11,3:36:08,1.1,33.5512,-116.9202,10.7,SOUTHERN CALIFORNIA,11004553,1549856168
2,2019,2,11,3:20:42,1.9,59.4979,-152.9018,73.5,SOUTHERN ALASKA,11004552,1549855242

# Q3 Show the last 3 lines

In [25]:
eq.tail(3)

,Year,Month,Day,Time UTC,Mag,Lat,Lon,Depth km,Region,IRIS ID,Timestamp
997,2019,2,7,1:18:34,2.2,17.9675,-67.1656,14.0,MONA PASSAGE,11003336,1549502314
998,2019,2,7,1:13:36,2.0,47.8600,-122.0438,27.8,WASHINGTON,11003335,1549502016
999,2019,2,7,1:12:42,1.4,60.9197,-151.0947,15.3,"KENAI PENINSULA, ALASKA",11003334,1549501962

# Q4 Show the column named 'Mag'

In [26]:
eq['Mag']

0      2.0
1      1.1
2      1.9
3      1.5
4      2.7
      ...
995    0.9
996    1.3
997    2.2
998    2.0
999    1.4
Name: Mag, Length: 1000, dtype: float64

# Q5 Show the columns named Mag and Region

In [27]:
eq.loc[:,['Mag','Region']]

     Mag                   Region
0    2.0          SOUTHERN ALASKA
1    1.1      SOUTHERN CALIFORNIA
2    1.9          SOUTHERN ALASKA
3    1.5           CENTRAL ALASKA
4    2.7           GULF OF ALASKA
..   ...                      ...
995  0.9      SOUTHERN CALIFORNIA
996  1.3          SOUTHERN ALASKA
997  2.2             MONA PASSAGE
998  2.0               WASHINGTON
999  1.4  KENAI PENINSULA, ALASKA

[1000 rows x 2 columns]

# Q6 Show the 2nd and 3rd lines

In [28]:
eq[1:3]

,Year,Month,Day,Time UTC,Mag,Lat,Lon,Depth km,Region,IRIS ID,Timestamp
1,2019,2,11,3:36:08,1.1,33.5512,-116.9202,10.7,SOUTHERN CALIFORNIA,11004553,1549856168
2,2019,2,11,3:20:42,1.9,59.4979,-152.9018,73.5,SOUTHERN ALASKA,11004552,1549855242

# Q7 Show the 2nd column

In [29]:
eq.iloc[:,1]

0      2
1      2
2      2
3      2
4      2
      ..
995    2
996    2
997    2
998    2
999    2
Name: Month, Length: 1000, dtype: int64

# Q8 Show the 2nd and 3rd column

In [30]:
eq.iloc[:,1:3]

     Month  Day
0        2   11
1        2   11
2        2   11
3        2   11
4        2   11
..     ...  ...
995      2    7
996      2    7
997      2    7
998      2    7
999      2    7

[1000 rows x 2 columns]

# Q9 Show the value at 4th row and 5 column

In [31]:
# use iloc
eq.iloc[3,4]

1.5

In [32]:
# use iat
eq.iat[3,4]

1.5

# Q10 Show the first 10 rows, and only show the information for "Time UTC", "Mag", and "Depth km"

In [33]:
#use iloc function
eq.iloc[0:10,[3,4,7]]

  Time UTC  Mag  Depth km
0  3:59:47  2.0      93.5
1  3:36:08  1.1      10.7
2  3:20:42  1.9      73.5
3  3:04:42  1.5       4.2
4  2:41:44  2.7      14.3
5  2:35:25  4.2     250.8
6  2:28:08  2.5       5.0
7  2:23:05  2.0       2.3
8  1:51:55  2.7      39.8
9  1:39:55  1.1      17.7

In [34]:
# combine loc function and iloc function
eq.loc[:,['Time UTC','Mag','Depth km']].iloc[0:10]

  Time UTC  Mag  Depth km
0  3:59:47  2.0      93.5
1  3:36:08  1.1      10.7
2  3:20:42  1.9      73.5
3  3:04:42  1.5       4.2
4  2:41:44  2.7      14.3
5  2:35:25  4.2     250.8
6  2:28:08  2.5       5.0
7  2:23:05  2.0       2.3
8  1:51:55  2.7      39.8
9  1:39:55  1.1      17.7